###################################################################

# Created by write_sdc on Sat Nov 20 00:11:39 2021

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_load -pin_load 3.40189 [get_ports {DOUT[12]}]
set_load -pin_load 3.40189 [get_ports {DOUT[11]}]
set_load -pin_load 3.40189 [get_ports {DOUT[10]}]
set_load -pin_load 3.40189 [get_ports {DOUT[9]}]
set_load -pin_load 3.40189 [get_ports {DOUT[8]}]
set_load -pin_load 3.40189 [get_ports {DOUT[7]}]
set_load -pin_load 3.40189 [get_ports {DOUT[6]}]
set_load -pin_load 3.40189 [get_ports {DOUT[5]}]
set_load -pin_load 3.40189 [get_ports {DOUT[4]}]
set_load -pin_load 3.40189 [get_ports {DOUT[3]}]
set_load -pin_load 3.40189 [get_ports {DOUT[2]}]
set_load -pin_load 3.40189 [get_ports {DOUT[1]}]
set_load -pin_load 3.40189 [get_ports {DOUT[0]}]
set_load -pin_load 3.40189 [get_ports VOUT]
create_clock [get_ports CLK]  -name my_clk  -period 1.71  -waveform {0 0.855}
set_clock_uncertainty 0.07  [get_clocks my_clk]
set_input_delay -clock my_clk  -max 0.5  [get_ports RST_n]
set_input_delay -clock my_clk  -max 0.5  [get_ports VIN]
set_input_delay -clock my_clk  -max 0.5  [get_ports {DIN[12]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {DIN[11]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {DIN[10]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {DIN[9]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {DIN[8]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {DIN[7]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {DIN[6]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {DIN[5]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {DIN[4]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {DIN[3]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {DIN[2]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {DIN[1]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {DIN[0]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {B0[12]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {B0[11]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {B0[10]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {B0[9]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {B0[8]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {B0[7]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {B0[6]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {B0[5]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {B0[4]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {B0[3]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {B0[2]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {B0[1]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {B0[0]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {B1_A1B0[12]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {B1_A1B0[11]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {B1_A1B0[10]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {B1_A1B0[9]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {B1_A1B0[8]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {B1_A1B0[7]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {B1_A1B0[6]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {B1_A1B0[5]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {B1_A1B0[4]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {B1_A1B0[3]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {B1_A1B0[2]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {B1_A1B0[1]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {B1_A1B0[0]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {A1B1[12]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {A1B1[11]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {A1B1[10]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {A1B1[9]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {A1B1[8]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {A1B1[7]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {A1B1[6]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {A1B1[5]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {A1B1[4]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {A1B1[3]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {A1B1[2]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {A1B1[1]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {A1B1[0]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {A1_2[12]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {A1_2[11]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {A1_2[10]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {A1_2[9]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {A1_2[8]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {A1_2[7]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {A1_2[6]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {A1_2[5]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {A1_2[4]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {A1_2[3]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {A1_2[2]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {A1_2[1]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {A1_2[0]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {DOUT[12]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {DOUT[11]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {DOUT[10]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {DOUT[9]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {DOUT[8]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {DOUT[7]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {DOUT[6]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {DOUT[5]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {DOUT[4]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {DOUT[3]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {DOUT[2]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {DOUT[1]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {DOUT[0]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports VOUT]
